#+TITLE:Alex Harter Resume
#+PROPERTY: header-args :tangle ~/Projects/Resume/resume.typ
- This file should be treated as the source of truth for my resume content
- For now, the primary target is the pdf generated by tangling typst source blocks
  - I choose this approach because
    - I'm still learning latex and org-export
    - It's still relatively direct, while taking advantage of org's notetaking, task, export control, and links
    - I can export this file, annontations and all, for interview prep
  - In the future, I may experiment with ox-latex or ox-html
- For some systems, I may need to export a docx file, in which case I can use pandoc or manually make the google doc match

- Helpful links:
  - [[https://typst.app/docs/reference/][Typst Docs]]
  - [[https://github.com/GeorgeHoneywood/alta-typst][alta-typst template]]
  - [[https://www.nerdfonts.com/cheat-sheet][nerd font icons]]
* Compile
#+BEGIN_SRC elisp :tangle no :results no
  (shell-command "typst compile resume.typ")
  (shell-command "brave resume.pdf")
#+END_SRC

#+RESULTS:
: 0

